src/test/java/com/adi/poc/tests/performance/artillery/BitpandaArtilleryPerformance.yml
config:
  target: "https://www.artillery.io"
  phases:
    - duration: 30
      arrivalRate: 0
      rampTo: 5
      name: Initial constant load phase (5 VUs for 30s)
    - duration: 15
      arrivalRate: 5
      rampTo: 1000
      name: Spike scenario (1000 VUs for 15s)
    - duration: 30
      arrivalRate: 0
      rampTo: 5
      name: Returning to constant load phase (5 VUs for 30s)
scenarios:
  - name: "Access Artillery.io main page & navigate to blog section"
    flow:
      - get:
          url: "/product"
      - get:
          url: "/blog"